{"kind":"blogger#post","id":"1601365589282507322","blog":{"id":"2360593805083673688"},"published":"2012-02-03T09:00:00-08:00","updated":"2012-02-03T09:00:08-08:00","url":"http://www.quietlikehorses.com/2012/02/story-about-two-sisters.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/1601365589282507322","title":"A story about two sisters","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/-pEZR3VQgjVQ/Tyt2sRNIGyI/AAAAAAAAMvQ/3g847AiF8IE/s1600/Screen+shot+2012-02-02+at+9.53.53+PM.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"640\" src=\"http://4.bp.blogspot.com/-pEZR3VQgjVQ/Tyt2sRNIGyI/AAAAAAAAMvQ/3g847AiF8IE/s640/Screen+shot+2012-02-02+at+9.53.53+PM.png\" width=\"462\" /></a></div>My sister Sophie is coming to visit this weekend! I'm playing hooky Monday and Tuesday (but not really because I totally requested it off and talked about it with my boss, but I like the way \"playing hooky\" makes me sound spontaneous and cool) so I can go tour a few colleges with her. She's transferring this fall, and I'm so excited for her.<br />\n<br />\nAnd, just because, here's a random sisterly story about Sophie: A few years ago she was cast in a Wii in-store video advertisement. A few weeks before the filming, she came to visit me in L.A. where I convinced her we should both get our hair cut at the Vidal Sassoon training school in Santa Monica where the haircuts are cheap&nbsp;(but also sometimes wildly unpredictable).&nbsp;Since she has thick, thick hair, they buzzed the entire back of her head leaving a fringe of long hair in the front and a few spiky tendrils in the back. Even though we were both slightly shocked, I must say she was very composed and &nbsp;rocked her rocker 'do for a long time waiting a good few years for the back to catch up to the front. And never once did she blame me for saying that I was sure that's where all the celebrities got their hair cut. At the filming, it turned out the on-set hair stylist was a genius at working with just a half head of hair and made it so you'd never know about her recent trip to Vidal. When the in-store video finally came out at Target and Best Buy, my dad and I would go and watch them with Sophie in tow, and I'd ask passersby if the girl in the video looked familiar which really embarrassed her to no end.<br />\n<br />\n(image via <a href=\"http://bit.ly/zqi2No\" target=\"_blank\">The Life Styled</a>)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"0","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/1601365589282507322/comments"},"labels":["To See"]}