{"kind":"blogger#post","id":"2210455364397470775","blog":{"id":"2360593805083673688"},"published":"2010-11-19T02:00:00-08:00","updated":"2010-11-19T02:00:10-08:00","url":"http://www.quietlikehorses.com/2010/11/gap-city-flats.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2210455364397470775","title":"Gap City Flats","content":"<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TOYn7gL5sGI/AAAAAAAAEv0/biTCnoN4Uco/s1600/gap%2Bflats%2Breview2.jpg\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 600px; height: 400px;\" src=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TOYn7gL5sGI/AAAAAAAAEv0/biTCnoN4Uco/s1600/gap%2Bflats%2Breview2.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5541160294731591778\" border=\"0\" /></a>When I saw <a href=\"http://gap.us/cjHpln\">these flats</a> in the Gap last week, I instantly fell in love. They're simple, chic, not too expensive ($39.50), and clever -- they come with a sparkly drawstring pouch so you can fold them up and fit them in your bag. The Gap describes them as fitting \"like a glove\" and \"ridiculously  comfortable,\" which are two statements that I don't take lightly when it comes to footwear (especially since the shoes I own that I really do consider to be ridiculously comfortable are the same shoes my grandma wears). As I read the online reviews for these shoes, the same sentiment that these are the last and only pair of flats you'll ever want to buy seemed to be echoed loud and clear. Could it be true? Could these cute shoes really be that comfortable? There was only one way to find out.<br /><br />I have been in search of some really comfy everyday flats for a while now, and when I saw these came in red, I was sold. I decided to test out my new shoes in the strenuous conditions of the office (just the other day I must have made at least 50 walking trips to unjam a printer -- just grueling amounts of walking I tell ya!) I planned to test them out during the entire week, but then I forgot to wear them every day (oops) so it turned out to be a 2-day test. Still, a lot of lessons were learned, and here were the results.<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TOYmd1tghuI/AAAAAAAAEvc/WMyn2Y_YGT0/s1600/meetings%2Bto%2Bcoffee%2Bbreaks.jpg\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 600px; height: 400px;\" src=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TOYmd1tghuI/AAAAAAAAEvc/WMyn2Y_YGT0/s1600/meetings%2Bto%2Bcoffee%2Bbreaks.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5541158685601990370\" border=\"0\" /></a>On Monday, I paired the flats with this dress that has just been begging for red flat companions ever since I first got it some years ago. Cute as the combo was, by the end of the day, I had to wear Band-Aids on my heels since the elastic backs were really cutting into my skin. I had also hoped that since the leather was so soft and buttery that they would give my wide feet room to splay out, but the shoes stayed pretty tight and narrow across the width of my foot which ended up hurting after a while.<br /><br /><a href=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TOYpjVk3s5I/AAAAAAAAEv8/hwKdz4htu84/s1600/gap%2Bflats%2Breview2.jpg\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 400px; height: 600px;\" src=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TOYpjVk3s5I/AAAAAAAAEv8/hwKdz4htu84/s1600/gap%2Bflats%2Breview2.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5541162078589924242\" border=\"0\" /></a>On Thursday, I wore them with a yellow cardigan and my favorite bow shirt.  By this second wear, I went the entire day without Band-Aids but found that the right shoe still dug annoyingly into my heel. And I'm sad to say that the narrow width of the show was still cramping my (very wide) style.<br /><div><br /></div><div>Overall, they are super cute, made of soft quality leather, and affordable, but not the perfect everyday flats for me. I think they'd be great for gals with normal width feet (there are at least 100 <span style=\"font-style: italic;\">raving</span> reviews on gap.com for these shoes so it must be true!) These shoes will be handy for short jaunts after a long day in heels or for when I need to add a pop of color to my feet, but they've left me continuing my search for those cute, legitimately ridiculously comfortable flats.<br /><br />Overall Scores (on a 5-star scale)<br />Style: 5<br />Functionality: 4<br />Comfort: 2 (but this is probably just because I have insanely wide feet)<br />Support: 1 (to be fair, they <span style=\"font-style: italic;\">are</span> ballet flats that fold in half so I wasn't really expecting much support to begin with)<br />Price: 3 (for genuine leather shoes, I think they are fairly priced)<br /></div><div>Additional perks: sparkly storage bag</div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"7","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2210455364397470775/comments"},"labels":["To Wear"]}