{"kind":"blogger#post","id":"46330925412117143","blog":{"id":"2360593805083673688"},"published":"2012-07-19T02:30:00-07:00","updated":"2012-07-19T02:30:03-07:00","url":"http://www.quietlikehorses.com/2012/07/office-talk-have-you-ever-been-fired.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/46330925412117143","title":"Office Talk: Have you ever been fired?","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://3.bp.blogspot.com/-i9AAYnFI3ek/UAelenpKMoI/AAAAAAAAOJ0/Tr8E6swbZQk/s1600/69031806758612643_J1r2QVnz_c.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"332\" src=\"http://3.bp.blogspot.com/-i9AAYnFI3ek/UAelenpKMoI/AAAAAAAAOJ0/Tr8E6swbZQk/s1600/69031806758612643_J1r2QVnz_c.jpg\" width=\"500\" /></a></div>\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://3.bp.blogspot.com/-CWWM3ebGiS8/UAelfQnQMJI/AAAAAAAAOJ8/OVjrdFbpT2I/s1600/114771490474098242_wlFGStuB_c.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"500\" src=\"http://3.bp.blogspot.com/-CWWM3ebGiS8/UAelfQnQMJI/AAAAAAAAOJ8/OVjrdFbpT2I/s1600/114771490474098242_wlFGStuB_c.jpg\" width=\"500\" /></a></div>\n<span style=\"background-color: white;\">There are two questions that sometimes come up in job applications that I never thought I'd have trouble answering: the one asking if I've ever been convicted of a felony and the other one asking if I've ever been \"dismissed or forced to resign.\" Of course, the first one is always easy to answer—no, in case you're wondering :)—but the second one, well, that one's harder.</span><br />\n<a name='more'></a><br />\n<span style=\"background-color: white;\">I hate to admit it, but I've totally been fired before. It happened one day at the ad agency I used to work for, after I'd just come back from a refreshing, long weekend in Mexico. Sure, the guy I worked for could <a href=\"http://bit.ly/LQ5Ies\" target=\"_blank\">sometimes be crazy</a>, but I was feeling well-rested and&nbsp;optimistic. But that wouldn't last very long. I was sitting at my desk, working on a project, when he called me into his office and asked me to close the door. (Did you ever see that Oprah episode where she talks about how our inner \"Danger Radar\" can tell us when something bad is about to happen? That's all I could think about as I sat down in his office.)&nbsp;</span><br />\n<br />\nI wasn't sure what was happening until he said, \"We're going to have to let you go,\" which I've since learned is a deceivingly nice way to say, \"You're fired, and we're not giving you any unemployment.\" I don't think I've ever felt the blood leave my face as fast as it did that day, but the news completely shocked me. It was like a bad break-up scene from a movie: on the one hand he was telling me I had 10 minutes to gather my things before I had to leave, and on the other he was telling me he could be a reference anytime I needed it and that I had done great work. The whole conversation left me really confused, and afterwards, I remember calling Alan and saying, \"I think I just got fired?\"<br />\n<br />\nIt turned out I was fired for \"stealing company property\" when I really had just added stuff I had worked on, and that had run in newspapers, to my online portfolio. Business hadn't been very hot for the prior few months and everyone's work hours (and pay) had been reduced to four-days a week, so it seemed harmless, at the time, to start preparing myself for the worst.<br />\n<br />\nSometimes, when people ask why I left the ad agency, it feels like this terrible dark secret from my past that I'm alway trying to hide. In fact, just this week my boss and I were talking about our old jobs when that exact question came up. I blurted out that I was fired and then did a nervous laugh to show her how so-very-silly it was and how&nbsp;<i>completely</i> over it I am (while desperately hoping inside that it wouldn't change her perception of me).<br />\n<br />\nI think enough time has gone by that I can joke about it, but I still feel the need to tell people it wasn't because I flipped out on the job or anything like that. (Although that would be really interesting).<br />\n<br />\n<b>Have you ever been fired? What was it like for you? Do you feel weird telling people, especially people you work with?</b><br />\n<b><br /></b><br />\n{unsourced first image, second image by <a href=\"http://bit.ly/Oq2ces\" target=\"_blank\">Kieron Horan</a>}<br />\n<br />","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"4","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/46330925412117143/comments"},"labels":["office talk","To See"]}