{"kind":"blogger#post","id":"5878324380398137385","blog":{"id":"2360593805083673688"},"published":"2011-10-27T02:30:00-07:00","updated":"2011-10-27T02:30:00-07:00","url":"http://www.quietlikehorses.com/2011/10/my-mildly-roaring-20s-corporate.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5878324380398137385","title":"My (Mildly) Roaring 20s: Corporate Bathroom Etiquette","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/-xJ4g5uzJdzc/Tqj7sdQ4JiI/AAAAAAAAJjE/zWBsre-eqL4/s1600/bathroom+closet.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"640\" src=\"http://4.bp.blogspot.com/-xJ4g5uzJdzc/Tqj7sdQ4JiI/AAAAAAAAJjE/zWBsre-eqL4/s640/bathroom+closet.jpg\" width=\"513\" /></a></div><br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"></div>There are a lot of tricky things to navigate in the corporate world, but a lot of it seems to be unspoken common knowledge. Like never being&nbsp;<i>that</i>&nbsp;person who takes the last cup of coffee in the morning and who doesn't make a new pot. But when it comes to corporate bathroom etiquette, it seems that anything goes.<br />\n<br />\nIn my mind, bathroom time equals private time — there's really no need for anyone else to know what's going on in your stall. Of course, everyone&nbsp;<i>knows</i>&nbsp;what's going on in your stall because everyone goes to the bathroom, so it's mind-boggling to me when some people act like they don't know. In my experience, I've known these people to come in two types: the conversationists and the lingerers.<br />\n<br />\n<a name='more'></a><br />\n<br />\nThe conversationist is the person who happens to be headed to the bathroom at the same time you are and who strikes up a friendly conversation. If the conversation ended as you entered the bathroom, it wouldn't be so bad, but the conversationist will likely keep it going even after you've both entered your respective stalls. And then will keep it going... as she flushes ...as she washes her hands ... as she fixes her hair ... as she waits for you to come out so you can walk out together. Why does the conversationist do this? It's awkward, and I wish the conversationists would stop.<br />\n<br />\nThe lingerers like to linger, and lingering in the bathroom is no different. Now, there's a time for lingering — like over dessert or the sweet words of a lover — and there's not a time for lingering. Like in the bathroom. If lingering in corporate bathrooms was encouraged, I would expect there to be plush couches (like the ones Nordstrom has in their bathrooms), but these are always nowhere to be found. Lingerers, true to their name, pull out all the stops. I once worked with a bathroom lingerer who had an entire 10-minute process she'd go through of flossing, brushing her teeth, and gargling with Listerine for a full two minutes. In these situations, the silence is deafening and distracting, and you almost wish you had a conversationist in the room.<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-DB5RyqWY6AQ/Tqj7tN92aWI/AAAAAAAAJjM/x9zchHkP3kk/s1600/bathroom.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"280\" src=\"http://1.bp.blogspot.com/-DB5RyqWY6AQ/Tqj7tN92aWI/AAAAAAAAJjM/x9zchHkP3kk/s400/bathroom.jpg\" width=\"400\" /></a></div><br />\nSometimes though, neither the conversationist nor the lingerer is to blame for awkward corporate bathroom experiences. Sometimes it's the fault of those who constructed the bathroom. In my current office, one of the bathroom stalls has gaps between the walls that are so wide, I once looked through it while in the stall and made eye contact with someone else waiting on the other side. <i>Eye contact</i>. Think about that for a second.<br />\n<br />\nI used to think it was just me who had these issues, until I told a friend who said that she can't go to the bathroom at all if there's even one other person in the room. If she really has to go, she'll go to a Starbucks because all of their bathrooms are the same and single stall.<br />\n<br />\nI know everyone's different, and I definitely know some people who have no problems whatsoever using multi-stall corporate bathrooms (although these people are usually conversationists). Once I saw a woman so comfortable with the bathroom that she actually placed her bagel and cream cheese (albeit on a paper plate) on the stall floor in front of her. I guess that's true corporate bathroom liberation, but I haven't gotten there yet. <br />\n<br />\nWhat about you? Do you have issues using bathrooms at work or are you a conversationist or lingerer?<br />\n<br />\n(Top image from <a href=\"http://bit.ly/tFftrn\">Lonny</a>; second image source unknown)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"10","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5878324380398137385/comments"},"labels":["My (Mildly) Roaring 20s"]}