{"kind":"blogger#post","id":"6009203199737431823","blog":{"id":"2360593805083673688"},"published":"2012-04-12T02:30:00-07:00","updated":"2012-04-12T02:30:01-07:00","url":"http://www.quietlikehorses.com/2012/04/office-talk-beating-presentation.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/6009203199737431823","title":"Office Talk: Beating the presentation jitters","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br />\n<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-CX62pSFczDU/T4ZmSdTdFWI/AAAAAAAANMo/KAG5-MbmbLk/s1600/headphones.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"640\" src=\"http://2.bp.blogspot.com/-CX62pSFczDU/T4ZmSdTdFWI/AAAAAAAANMo/KAG5-MbmbLk/s640/headphones.jpg\" width=\"481\" /></a></div>Confession: Giving presentations gives me a severe case of nervous belly (as my friend <a href=\"http://bit.ly/qLvIkk\" target=\"_blank\">Stacy</a> would call it). I have a hard time breathing normally, my heart starts pounding so hard I swear everyone in the room can see it beating through my shirt, and my voice gets shaky. It's pretty awful, for me and for the audience, I'm sure. It's really odd, though, because in college I rocked at public speaking. I remember for one of my senior projects, I had to give an end-of-quarter presentation and convinced my partner we should do it to the theme of Survivor. We had the theme song playing and we presented in character—it was kinda crazy but I remember I didn't think anything of it. Then I started working and something happened because all of a sudden even the thought of presenting would put me in a cold sweat.<br />\n<br />\nThis week I had to give a presentation, and I worried in the days leading up to it that I'd do a terrible job. So in a <s>desperate</s> innovative attempt to calm myself, I started doing two new things to prepare that ended up helping tremendously.<br />\n<br />\n<a name='more'></a><br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-4Y2y92JkmEo/T4ZzWEYV-TI/AAAAAAAANNc/BGxaXcc71hQ/s1600/elvis.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><img border=\"0\" height=\"640\" src=\"http://1.bp.blogspot.com/-4Y2y92JkmEo/T4ZzWEYV-TI/AAAAAAAANNc/BGxaXcc71hQ/s640/elvis.jpg\" width=\"442\" /></a></div><div>1) The first thing I did was to go on walks and record myself on my iPhone while talking through my presentation. Later, I'd listen back to it and analyze if what I was saying made sense and followed a flow. I'd listen to see if I was talking too fast or too slow and if I was using too many fillers like \"um.\" The biggest benefit of doing this, though, was that I realized I didn't sound half as bad as I thought!<br />\n<br />\n2) The second thing I did was to think about what was making me so nervous. I couldn't pinpoint an exact reason, but I think it's safe to say that I didn't want to sound dumb. So then I'd visualize someone interrupting me halfway through my presentation, standing up and pointing a finger at me, and shouting, \"That's stupid!\" (Aziz Ansari style, if you can imagine it). It's ridiculous, but the more I pictured it, the funnier and more preposterous it became and the more I was able to think, <i>Well if that's not going to happen, what do I have to worry about?</i><br />\n<i><br />\n</i><br />\nFor the first time in my recent presentation history, I ended up not having a crazy&nbsp;arrhythmia&nbsp;or speech impediment during the presentation <i>and</i> no one stood up and shouted at me in the middle of it. Success!<br />\n<br />\nDo you have a fear of presenting? Or are you the exact opposite? I'd love to hear about your own experiences and any presentation tips you have to share.<br />\n<i><br />\n</i><br />\n<i>(<a href=\"http://bit.ly/HJxH0v\" target=\"_blank\">top image</a>, <a href=\"http://bit.ly/IwHcAn\" target=\"_blank\">bottom image</a>)</i></div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"1","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/6009203199737431823/comments"},"labels":["To See"]}