{"kind":"blogger#post","id":"7074541768283111117","blog":{"id":"2360593805083673688"},"published":"2010-10-01T02:00:00-07:00","updated":"2010-10-01T02:00:07-07:00","url":"http://www.quietlikehorses.com/2010/10/how-to-lush-lashes-in-blink-of-eye.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/7074541768283111117","title":"How To: Lush Lashes in the Blink of an Eye","content":"<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKWE4_REtRI/AAAAAAAAEe8/D7Auy5g5IXE/s1600/Recently+Updated7.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 338px;\" src=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKWE4_REtRI/AAAAAAAAEe8/D7Auy5g5IXE/s1600/Recently+Updated7.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522966632630367506\" border=\"0\" /></a>Although I don't wear much makeup, there is one thing I need to have on before running out the door: a pretty pair of lashes. I learned everything I know on the subject from my sis Sophie. I have never seen anyone with thicker, longer lashes than her. She must get asked if she's wearing fake eyelashes at least once a day. So, a few years ago, while I was home for the holidays, I watched her get ready and picked up on all her lash secrets. Here they are for your peeping pleasure!<br /><br />Tip #1: It's All in the Curl<br />Pick a good eyelash curler (I use Shiseido's). Get as close to the base of your lashes with the curler as possible and squeeze. Then move your curler away from your eye, up your lashes, curling as you go until you get to the tips. This is about 3 squeezes in total. As you curl in successive squeezes, your eyelash curler should move from being perpendicular to the floor to parallel to it. Don't skimp on this step, take your time. Rushing through this step (especially if you have impossibly straight lashes like I do) is like forgetting to mix in the chocolate chips into your chocolate chip cookie dough -- the end result is just not going to be the same.<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKWE4mYdPEI/AAAAAAAAEe0/ANIzjL7gn0s/s1600/Recently+Updated8.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 338px;\" src=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKWE4mYdPEI/AAAAAAAAEe0/ANIzjL7gn0s/s1600/Recently+Updated8.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522966625950448706\" border=\"0\" /></a>Trick #2: Gettin' Wiggly with It<br />Once your lashes are curled, the next step is to apply your mascara of choice (we'll get to some suggestions later). Sophie insists the only meaningful way to apply mascara is by starting from the inside of your eye and working your way out, wiggling the brush from side to side as you do. So wiggle that brush in, wiggle that brush out, wiggle that brush in and then shake it all about!<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://2.bp.blogspot.com/_mkw1MyhyGTY/TKWE4aixFxI/AAAAAAAAEes/OzQKu6plbQw/s1600/Recently+Updated9.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 338px;\" src=\"http://2.bp.blogspot.com/_mkw1MyhyGTY/TKWE4aixFxI/AAAAAAAAEes/OzQKu6plbQw/s1600/Recently+Updated9.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522966622772467474\" border=\"0\" /></a>And presto magic-o! Beautiful lashes for making eyes at the milk man with.<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TKWE4JaMXtI/AAAAAAAAEek/s9hndfle3N4/s1600/Recently+Updated10.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 600px;\" src=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TKWE4JaMXtI/AAAAAAAAEek/s9hndfle3N4/s1600/Recently+Updated10.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522966618173103826\" border=\"0\" /></a>Tip #3: Different Strokes for Different Folks--Your Mascara Matters<br />One trip to the makeup aisle at Target or Sephora and you'll see that there is seriously no shortage of mascara out there. So which one do you pick? The waterproof? The curling? The plumping/thickening? Or the vibrating? (What <span style=\"font-style: italic;\">will</span> they come up with next?!) Sophie has tried out nearly every mascara on the market and can attest that not all mascaras are created equal. The trick is finding one that works for you. Because I have such stubbornly straight lashes, she recommended I try a waterproof formula and introduced me to Maybelline's Lash Stylist who turned out to be my best gal pal for many years. It delivered a long lasting hold on my curl and lots of length. It would tend to clump your lashes together if you weren't careful, but for under $7 a tube, I couldn't complain. Now that it's been discontinued though, I started looking around at the other mascara-fish in the sea.<br /><br />I had heard good things about Chanel's Inimitable and decided to give it a whirl. At $32 a pop, I hoped that maybe it wouldn't live up to the rave reviews and that I wouldn't fall in love with it. But sometimes, I suppose, you just can't fight true love. This mascara is magical. It coats all lashes evenly, even the itty bitty ones at the inside corners of your eyes. And it doesn't clump. I love it so and have already promised to name my first born after it, even though the name doesn't really roll off the tongue...","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"8","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/7074541768283111117/comments"},"labels":["To Wear"]}