{"kind":"blogger#post","id":"8327799126555646443","blog":{"id":"2360593805083673688"},"published":"2011-11-17T02:30:00-08:00","updated":"2011-11-17T02:30:02-08:00","url":"http://www.quietlikehorses.com/2011/11/my-mildly-roaring-20s-conversations.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8327799126555646443","title":"My (Mildly) Roaring 20s: Conversations Between Couples","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-lPiwpZeAVkM/TsTBpZH78uI/AAAAAAAAJvw/iP2fGDJfW9M/s1600/couple.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-lPiwpZeAVkM/TsTBpZH78uI/AAAAAAAAJvw/iP2fGDJfW9M/s1600/couple.jpg\" /></a></div>Do you ever wonder what couples talk about when they're alone? I imagine that just like the kinds of conversations you have with your mom or your best friend, the heart-to-hearts you have with your significant other are different from the talks you have with anyone else. Alan and I talk about all sorts of things. There are a lot of random things and then there are things that carry over from conversation to conversation. Last week, we talked about what we'd want the other person to read to us if we ever got diagnosed with locked-in syndrome. (We both agreed on David Sedaris.) Alan talks a lot about the faults of our couch; I talk about finding a rug to pull the room together. We both somehow bring up a basset hound topic at least once a day (their walks, their sausage shape, their silly personalities... we could really go on).<br />\n<br />\nSometimes though, the most telling conversations are the ones that couples don't have together. Like the ones between my grandparents. They've been together for over 60 years, have raised 11 children, and have ventured across the globe from Cambodia to California to start a new life together. They're barely ever apart. Once, my grandma shared the benefits of marriage with us as she saw them. She said there were two great things: 1) that you only have to make half of the bed in the morning and 2) that you have someone to share a few words with each day. Just a few. In all the times I've seen them together, they're never particularly chatty.<br />\n<br />\nThis weekend my grandpa was hospitalized. We all feared and suspected it was an unstoppable cancer even before the biopsy came back, but no one dared tell my grandma until there was absolutely no denying it. But she knew. Somehow she knew. On the first day of his hospital stay, our huge family filled his room. We all tried to talk about other things. I talked about the cat slippers he had brought from home. Someone else talked about the hospital food. My grandma didn't say much. Mostly, she sat and watched him, like she was afraid he would disappear any second.&nbsp;I wondered if I'd ever know what they talked about alone in their apartment.<br />\n<br />\nAt one point, my cousin and I stepped out of the room for a break. Grandma followed. The door shut behind her, and all of a sudden she was saying everything she felt in their decades of life together without saying anything at all. She cried and cried, in the the most terrible soul-gripping way. There was nothing anyone could say. And after, she wiped away her tears, went back inside, and our hearts hurt. <br />\n<br />\n<br />\n(Image by&nbsp;<a href=\"http://bit.ly/sdsvVp\" target=\"_blank\">devil_smile55</a>)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"9","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8327799126555646443/comments"},"labels":["My (Mildly) Roaring 20s"]}