{"kind":"blogger#post","id":"8563176795907299447","blog":{"id":"2360593805083673688"},"published":"2011-11-10T02:30:00-08:00","updated":"2011-11-10T23:21:41-08:00","url":"http://www.quietlikehorses.com/2011/11/my-mildly-roaring-20s-business-trip.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8563176795907299447","title":"My (Mildly) Roaring 20s: Business Trip Adventures","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-Y9o_aAOZQhc/Trt-admFDyI/AAAAAAAAJsY/hZfeFv7i4_A/s1600/UpInTheAir.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"181\" src=\"http://2.bp.blogspot.com/-Y9o_aAOZQhc/Trt-admFDyI/AAAAAAAAJsY/hZfeFv7i4_A/s400/UpInTheAir.jpg\" width=\"400\" /></a></div><br />\nThe career fairs I'd go to my senior year of college felt really exciting. Everyone would be wearing suits and looking all professional (a big change from the sea of jeans and flip flops you'd normally see around campus every day). I'd talk to recruiters and try to impress them with the modest things I thought they might find impressive on my short resume, and in turn, they'd try to impress me with their glossy brochures and official-looking business cards.<br />\n<br />\nThe best part was when recent graduates were there to represent their current employers. These people had jobs. Which meant that they were the people I wanted to be. My favorite question to ask them was \"What's a typical day like for you?\" And my favorite response, the one I got a lot, was \"It's hard to say — every day is different!\" Of course, now I know that most people's work days aren't that remarkably different, but back then, boy, I thought this meant that I'd be sealing million dollar deals one day and jumping out of planes the next.<br />\n<br />\nWorking in a stable office environment has taught me to embrace the small things that make each day unique: cake on somebody's birthday, a particularly satisfying lunch, a tiny bit of water-cooler gossip. For me, the king of these small indulgences, the thing that really shakes things up, are business trips. I've only been on a handful here and there, so I definitely haven't tired of them yet, and I could see how they wouldn't be fun if you had to do it all the time or are forever going for no-fun reasons, but almost every business trip I've gone on has been pretty neat. Two of my favorites are the time I went to prison and the time I went to Tennessee to eat at Wolfgang Puck Express.<br />\n<br />\n<a name='more'></a><br />\n<br />\nI didn't know I was going to prison until a few weeks before the trip. We were going to visit the remote inside sales team we worked with (which I had always assumed worked in a nice air-conditioned office space somewhere in Phoenix) that turned out to be a team that operated out of the state prison. I called my parents to try to get them to worry about me —  I told them I was going to prison. I had been waiting a good few decades to spring something like this on them, and I waited anxiously for their outrage, their delayed concern. But it never came. Maybe they just didn't understand what I was saying or maybe because they know me too well, but they didn't think my going to prison was that big of a deal. When I finally got there, I saw they were right. The visiting room was filled not with the faces of hardened criminals, but with ladies wearing pink lipstick who had voluminous, freshly curled hair. They were eloquent and chipper and found our presentation interesting and useful. It was definitely not like everything you see in the movies.<br />\n<br />\nMy other favorite business trip was one of the first ones I'd ever been on. We flew to Tennessee to help Wolfgang Puck Express understand how to attract more customers. My genius boss (who reminds me of Donald Draper for his creativity) decided we'd do this through a focus group on wheels. So a group of strangers and I drove around in a van for an entire day eating at Wolfgang Puck Express and their competitors' restaurants and talking about what we liked and what we didn't back in the van. It was amazing!<br />\n<br />\n<b>Do you travel for work? If so, do you enjoy it? What's one of your most memorable business trips?</b><br />\n<b><br />\n</b><br />\n(image from Up in the Air)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"5","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8563176795907299447/comments"},"labels":["My (Mildly) Roaring 20s"]}