{"kind":"blogger#post","id":"9120675109734663304","blog":{"id":"2360593805083673688"},"published":"2011-11-03T02:30:00-07:00","updated":"2011-11-03T02:30:02-07:00","url":"http://www.quietlikehorses.com/2011/11/my-mildly-roaring-20s-misheard-names.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/9120675109734663304","title":"My (Mildly) Roaring 20s: Misheard Names","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-oxieTpoRKQA/TrI25VP6LNI/AAAAAAAAJko/AVVRsoRucmY/s1600/telephone.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-oxieTpoRKQA/TrI25VP6LNI/AAAAAAAAJko/AVVRsoRucmY/s1600/telephone.jpg\" /></a></div><br />\nEvery visit to Starbucks is remarkably similar. It's the intentional consistency of the ordering process, the drink menu, the pastries, and the green aprons that's converted me. But for all of those similarities, I can almost always count on there being a small twist to every visit: the name given to me on the side of my cup. It's always some sound-a-like version of my real name, but it's just different enough to keep things interesting. For example, as Sobrina, I'm just your typical multi-city library card holder. But when I order a latte and find my name's been changed to something exciting, something like <i>Subarenah</i>, I transform! I become a person who knows about things like raves!<br />\n<br />\nThis Misheard Name Phenomenon happens all the time, and not just at Starbucks. My co-worker Brian who ordered an empanada for lunch became Barney. Ordering Thai takeout on the phone, I become Lina. And it never gets old, I crack up every time!<br />\n<br />\nMy co-worker Amanda told me about the misheard name she gets most often. She said when she orders at restaurants, she'll give her name as Amanda, and the name repeated back to her is... Fernando. It even happens when she orders in person despite her being a very cute girl! Isn't that the funniest, most unexpected misheard name ever?<br />\n<br />\nHave you experienced the Misheard Name Phenomenon?<br />\n<br />\np.s. I love <a href=\"http://bit.ly/vioTd8\">this episode of <i>How I Met Your Mother</i></a> where Barney experiences it and gets dubbed Swarley. And a <a href=\"http://bit.ly/s9qMrq\">tumblr</a> dedicated to this very topic!<br />\n<br />\n(image by <a href=\"http://bit.ly/rNELai\">Urban Muser</a>)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"5","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/9120675109734663304/comments"},"labels":["To See"]}