{"kind":"blogger#post","id":"2040440537041756173","blog":{"id":"2360593805083673688"},"published":"2012-05-25T02:30:00-07:00","updated":"2012-05-25T02:30:01-07:00","url":"http://www.quietlikehorses.com/2012/05/best-20-youll-ever-spend.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2040440537041756173","title":"The best $20 you'll ever spend","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://3.bp.blogspot.com/-be0io-VhTWo/T7yIPjP3wNI/AAAAAAAANn8/usEi-PecfsI/s1600/lilac+spa.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"lilac spa\" border=\"0\" src=\"http://3.bp.blogspot.com/-be0io-VhTWo/T7yIPjP3wNI/AAAAAAAANn8/usEi-PecfsI/s1600/lilac+spa.jpg\" title=\"lilac spa\" /></a></div>\nWhen I was in Cambodia last year, I had the best massage of my life. It lasted an hour, loosened every knot in my body, and cost just $4! (By my calculations, that would buy you a two-minute massage at most places here). I was totally spoiled by the experience, so when I came back home I just couldn't bring myself to pay normal massage prices of $100+.&nbsp;But then I discovered $20 foot spas...<br />\n<br />\n<a name='more'></a><br />\n<br />\nContrary to being called a foot spa, they actually massage your whole body! For an hour! Since I carry all my stress and tension in my shoulders, I was always super curious about checking one out, but no one ever wanted to go with me. (More often than not people would roll their eyes and make a joke about it being <i>that </i>kind of massage place). My friend Lauren and I finally went this past weekend so now I can officially lay all those jokes to rest because it was EXCELLENT.<br />\n<br />\nWhen you first get there, you'll see all the front windows blacked out (you could see how people would think there's funny business going on), but once you're inside you see they do that to keep the room nice and dark. Everyone sits in one big room with a few rows of&nbsp;comfy stuffed&nbsp;chairs in it, and there's calming music playing in the background. You keep all your clothes on but take off your socks and shoes. (I made sure to wear stretchy, loose clothes).<br />\n<br />\nThe masseuse starts by massaging your scalp--this was Lauren's favorite because she said it reminded her of the massage she gets when they wash her hair at the salon--and then they do your face. At first it kinda freaked me out, but they massage the pressure points around your temples and in between your eyebrows so it felt really relaxing. Next, they massage your hands, arms, legs, and feet. I was so relaxed, I almost fell asleep! Then you flip over onto your stomach, and they massage your entire back side.<br />\n<br />\nIt's definitely not a fancy retreat or spa oasis, but when the hour was up, we both felt&nbsp;<i>amazing</i>--loose, light, and totally relaxed.&nbsp;All I could think was <i>Why didn't I come here sooner?</i><br />\n<i><br /></i><br />\n<b>Are you a fan of massages?&nbsp;Have you been to a foot spa before or would you go?&nbsp;</b><br />\n<b><br /></b><br />\n(image via <a href=\"http://bit.ly/JmtuSw\" target=\"_blank\">Little Snob Thing</a>)<br />\n<br />","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"3","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2040440537041756173/comments"},"labels":["To See"]}