{"kind":"blogger#post","id":"2289033438912549890","blog":{"id":"2360593805083673688"},"published":"2012-01-09T02:30:00-08:00","updated":"2012-01-09T02:30:00-08:00","url":"http://www.quietlikehorses.com/2012/01/new-spindle-lamps-story-about-resolve.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2289033438912549890","title":"New spindle lamps + a story about resolve","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-1HvbM61h2Y8/TwqEK9WrXZI/AAAAAAAAMlw/my-wut4ZTPk/s1600/chevron+lamp+shade.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://2.bp.blogspot.com/-1HvbM61h2Y8/TwqEK9WrXZI/AAAAAAAAMlw/my-wut4ZTPk/s1600/chevron+lamp+shade.jpg\" /></a></div>This weekend I went to Target to return something we'd gotten for Christmas that I knew we'd never use. (I realize this might make me sound like a horrible person, but before you start thinking that I'm a regular gift-returner, I should add that it was something we'd gotten in a white elephant gift exchange. So it's not like it was given to us with us, specifically, in mind and was returned, then, out of picker's remorse more than anything.) It had been sitting on our counter for weeks, and I knew if I didn't do something soon it would sit there forever. And since I had resolved to lead a <a href=\"http://bit.ly/rCqU56\" target=\"_blank\">simpler, less-cluttered life</a>&nbsp;just last week,&nbsp;this weekend I decided to do something about it.<br />\n<br />\nAt the store, the clerk told me since I didn't have a receipt I could only get the current asking price for the item, which was $1. I looked to Alan for advice: take the dollar and be done with it or take the item home and try, no matter how desperately, to make it work? His eyes said take the item back, but my newfound less-clutter-is-better heart said take the dollar, which is what I did. Later, Alan told me he was going to write to the producers of Hoarders about me: the anti-hoarder. Never mind that that would be a terribly boring show — a show about someone who <i>doesn't</i>&nbsp;keep 50 cats or bags of used sanitary napkins next to their bed? Please. People have entertainment standards!&nbsp;— I think he was trying to tell me that I'm going a little overboard with the de-cluttering. But as a person who was on the verge of collecting years' worth of toenail clippings and who still can't let go of her pencil box from fourth grade, I took that as a huge compliment.<br />\n<br />\nI don't think my house will ever look as simple and neat as <a href=\"http://bit.ly/xEa0eQ\" target=\"_blank\">this</a>, but it's getting to a much better place. Now I can start focusing on adding in the things that I really like.&nbsp;We really needed new lamps for the living room (I knew my wire Eiffel Tower lamp from college had to go when Alan remarked that he liked how it was so very \"steam punk\") and these <a href=\"http://bit.ly/A0WksA\" target=\"_blank\">spindle lamps</a> and <a href=\"http://bit.ly/AvASWa\" target=\"_blank\">chevron shades</a> were less than $100 for the pair! They look a lot like my spendier lamp inspirations by&nbsp;<a href=\"http://bit.ly/yPCvdZ\" target=\"_blank\">Jonathan Adler</a> and <a href=\"http://bit.ly/xvbMEI\" target=\"_blank\">Neiman Marcus</a>, but for way less. And luckily I already had an extra dollar in my wallet to help cover the cost.","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"2","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2289033438912549890/comments"},"labels":["To See"]}