{"kind":"blogger#post","id":"2375305519018536329","blog":{"id":"2360593805083673688"},"published":"2012-08-30T09:06:00-07:00","updated":"2012-08-30T09:06:01-07:00","url":"http://www.quietlikehorses.com/2012/08/in-office-sarah-garcia-usability.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2375305519018536329","title":"In the Office: Sarah Garcia, Usability Experience Researcher","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://1.bp.blogspot.com/-gvZK2TUZWQA/UD-BavNbr4I/AAAAAAAAPDw/7tJNduiYTUI/s1600/nameplate.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"500\" src=\"http://1.bp.blogspot.com/-gvZK2TUZWQA/UD-BavNbr4I/AAAAAAAAPDw/7tJNduiYTUI/s1600/nameplate.jpg\" width=\"600\" /></a></div>\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://2.bp.blogspot.com/-Wq9MHe05xjU/UD-BaN56mcI/AAAAAAAAPDo/9_JTfLHbxd8/s1600/UE12_0171web.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://2.bp.blogspot.com/-Wq9MHe05xjU/UD-BaN56mcI/AAAAAAAAPDo/9_JTfLHbxd8/s1600/UE12_0171web.jpg\" width=\"600\" /></a></div>\n<br />\nWhenever I go over to my friend Sarah Garcia's house, I look forward to eating dinner (one night she set up a make-your-own-bruschetta bar with things like figs and goat cheese) and hearing about the latest projects she's working on. She's so passionate about her job—and does it well—which I love. I'm excited to kick off the new series with her interview.<br />\n<br />\n<a name='more'></a><br />\n<br />\n<b>What do you do?&nbsp;</b><br />\nMy “fun” title: Sleuth; my&nbsp;“serious” title: Lead Researcher.<br />\n<br />\nI’m a usability experience researcher at the <a href=\"http://bit.ly/Nzb3xl\" target=\"_blank\">UEGroup</a>. I didn't know what&nbsp;that meant before I got this job, but essentially, we are hired by&nbsp;companies to “test” their products/websites/devices for usability. I&nbsp;lead sessions with users to discover what the user needs and wants&nbsp;and how the company we are helping can better meet those needs.<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://4.bp.blogspot.com/-59zuXQeBiNQ/UD-BlkxVIgI/AAAAAAAAPD4/lia8vCP9BXg/s1600/UE12_0177web.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://4.bp.blogspot.com/-59zuXQeBiNQ/UD-BlkxVIgI/AAAAAAAAPD4/lia8vCP9BXg/s1600/UE12_0177web.jpg\" width=\"600\" /></a></div>\n<br />\n<b>What does a typical day look like?</b><br />\nI’m sitting more than I’d like, but my days, weeks and months have&nbsp;variety. I’m always at some stage of the research process—either&nbsp;planning, conducting research or writing reports on the results. My&nbsp;favorite part is definitely the research phase. Depending on the&nbsp;project, we will either go to the user location and observe/conduct&nbsp;interviews or bring them to our lab to give feedback on whatever it is&nbsp;we are testing. I love being with the users—really finding out what&nbsp;people think and why. Days pass quickly even if sometimes they are&nbsp;long days.<br />\n<br />\n<b>How did you get into this?&nbsp;</b><br />\nI often tell people that if I had known this job existed I would have&nbsp;gone to school for it. But, fortunately for me, it just sort of fell&nbsp;in my lap. I was looking for a super part time job when my kids&nbsp;were little and through a friend was introduced to my boss and his&nbsp;wife. I helped with administrative stuff which led to taking notes&nbsp;during research sessions, which led to filling in for my boss during&nbsp;one session which led to assisting on projects to eventually leading&nbsp;projects. In some ways it seems like happenstance, but in others it&nbsp;really is the perfect way to blend my marketing degree with my love&nbsp;for people and naturally inquisitive nature.<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://1.bp.blogspot.com/-lJNtGLSLlD4/UD-BuSKqOFI/AAAAAAAAPEA/1hctSLkBnUE/s1600/UE12_0170web.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://1.bp.blogspot.com/-lJNtGLSLlD4/UD-BuSKqOFI/AAAAAAAAPEA/1hctSLkBnUE/s1600/UE12_0170web.jpg\" width=\"600\" /></a></div>\n<br />\n<b>What do you find really satisfying about your work?</b><br />\nI love discovering some finding that wasn’t a part of my original&nbsp;hypothesis. For instance, once I was doing an ethnographic visit&nbsp;at a doctor’s office to understand how the doctor uses a particular<br />\nsoftware interface but watched as the doctor struggled with holding&nbsp;everything she needed to hold just to do her job. We were focused&nbsp;on the interface itself, but the bigger problem was tackling the device&nbsp;and environment.<br />\n<br />\n<b>What's one of your favorite work memories or projects you've worked&nbsp;</b><b>on?</b><br />\nWe were working on a project for a company that helps patients&nbsp;with Parkinson’s Disease. I got to observe a doctor’s appointment&nbsp;with a patient who had recently been implanted with a device to<br />\ntreat Parkinson’s. To see the moment when the patient saw his hand&nbsp;stop moving after years of having a tremor was almost a modern-day miracle. His wife was in tears and I was humbled to be able to&nbsp;be there and continue work on a project that was so meaningful.&nbsp;Websites and devices are definitely cool, but the projects that are&nbsp;affecting people are the most fulfilling.<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://1.bp.blogspot.com/-yOxsEcgWGrs/UD-B1WCyv6I/AAAAAAAAPEI/_S__gBaXgck/s1600/UE12_0005web.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://1.bp.blogspot.com/-yOxsEcgWGrs/UD-B1WCyv6I/AAAAAAAAPEI/_S__gBaXgck/s1600/UE12_0005web.jpg\" width=\"600\" /></a></div>\n<br />\n<b>What's the craziest thing that's ever happened at work?</b><br />\nMy co-worker and I had a project that required a bunch of travel. We&nbsp;literally would fly across the country for one 2 hour interview with a&nbsp;specialized doctor. It was winter, and during that time, there were a&nbsp;ridiculous amount of snow storms on the East Coast. We got stuck in at&nbsp;least two, and in one instance, we flew all the way to Philadelphia to get&nbsp;stuck in a hotel with our client for two days, only getting to speak to the&nbsp;doctor for a half an hour.<br />\n<br />\n<b>What do you normally do for lunch?</b><br />\nWe almost always bring our lunch, despite working in Downtown&nbsp;Willow Glen with an amazing lunch option. To keep the waistline and&nbsp;budget down, we all usually bring our lunch and take it outside to&nbsp;eat, or take a walk around the neighborhood to get some fresh air.<br />\n<br />\n<b>Is there anything about the job that came as a surprise to you or was&nbsp;</b><b>unexpected?</b><br />\nI’m always a little bit surprised by the caliber of clients we’ve worked&nbsp;with. Since a lot of what we do is confidential, I’m used to not really&nbsp;talking about it…but sometimes I’ll be at a client’s conference room,&nbsp;finishing up a presentation on work I’ve done and I’ll think, “Holy&nbsp;cow, people from eBay are actually listening to me.” In one sense it&nbsp;makes me take the responsibility that I have to represent the users&nbsp;very seriously. In another sense, it makes me uncomfortable and&nbsp;proud all at the same time.<br />\n<br />\n<b>What does it take to be successful in your job/field?</b><br />\nYou have to speak with authority, but you can’t be full of BS. You have&nbsp;to be a learner, a student of people and things. You can’t pretend to&nbsp;know all the answers, because our job is all about learning from users&nbsp;and others. You have to be able to listen and draw things out of people&nbsp;in a way that makes them comfortable. You have to be willing to tell a&nbsp;company the truth, but offer constructive ways of solving the problems.<br />\n<br />\n<b>Any words of advice?</b><br />\nBe faithful in the small things. I firmly believe I grew into this position&nbsp;because I did the small things well, and they grew into bigger things.&nbsp;Having said that, we are a company that doesn’t really pride itself on titles,&nbsp;because we all do the small things to help each other out. In the end, all&nbsp;the small things are really what make up the big things.<br />\n--<br />\n<br />\nThank you so much, Sarah!","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"0","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2375305519018536329/comments"},"labels":["In the Office","To See"]}