{"kind":"blogger#post","id":"2656998591923325560","blog":{"id":"2360593805083673688"},"published":"2011-10-06T02:30:00-07:00","updated":"2011-10-06T02:30:01-07:00","url":"http://www.quietlikehorses.com/2011/10/my-mildly-roaring-20s-living-with-boys.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2656998591923325560","title":"My (Mildly) Roaring 20s: Living with Boys","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-Gk978igxFLA/To1bNuaGFOI/AAAAAAAAJcs/E7zKDq4TNXU/s1600/the_new_girl_1.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://2.bp.blogspot.com/-Gk978igxFLA/To1bNuaGFOI/AAAAAAAAJcs/E7zKDq4TNXU/s640/the_new_girl_1.jpg\" width=\"600\" /></a></div><div style=\"text-align: center;\"><span class=\"Apple-style-span\" style=\"font-size: x-small;\">(img via <a href=\"http://tbivision.com/article.php?category=9&amp;article=2260\">TBI vision</a>)</span></div><div style=\"text-align: center;\"><span class=\"Apple-style-span\" style=\"font-size: x-small;\"><br />\n</span></div><div class=\"separator\" style=\"clear: both; text-align: left;\">Remember last week when I said I wanted to start writing more? Well, I've been thinking about it, and I would love to write something like Joanna Goddard's weekly blog series on motherhood. She has a 1.5 year old and always has funny and touching insights to share on her experiences as a new mom. I thought about what I could write about that I'm an \"expert\" on. After many conversations with myself in the shower, I decided that being in my eighth year of my 20s, I am sort of an expert on things that can happen to you during this exciting decade of life. (Okay, that is kind of a vast overstatement if I ever heard one, so let's just say that at the very least, I have lots of stories to tell from this span of my life.)</div><br />\nNow that I had the topic squared away, I needed a title for the series. Something catchy (Joanna's series is aptly titled \"Motherhood Mondays\"). \"My Roaring 20s\" sounded fun but also made it sound like I live a life like Beyonce's — all glamorous and private planes and mini bar indulgences — so I toned it down a little to make it more accurate. And&nbsp;there you have it: the whole story on how this little series came to be. For my first post, I'd like to talk about living with boys and having a platonic boy roommate, which I did my senior year of college.<br />\n<br />\n<a name='more'></a><br />\n<br />\nIn my senior year of college, for a few reasons that left me without a place to live a few weeks before school began, I found myself living with three boys named John, Lawrence, and Keith in a spacious&nbsp;(relatively speaking)&nbsp;2-bedroom apartment. Keith and I shared a room and Lawrence and John shared the other. If you were to ask me today if I could share a room with a boy with whom I had a non-romantic relationship, I'd probably say I couldn't. That I liked to be in my underwear too much and all that kind of stuff. But back then, it didn't feel weird at all to be sharing a room with a guy I barely knew. This could have either been because they were all in the engineering department (Keith was even in a fraternity named Triangle) or because they were just really nice guys. It was probably a little bit of both.<br />\n<div><br />\n</div><div>Keith and I arranged our beds along opposite sides of the room and placed our desks so that they faced each other. We often did our work there in the evenings and would take breaks to share a story from our days. As we became more comfortable with each other, it also became okay to put on headphones to indicate to the other person when we wanted to be alone, even when we were just a few feet apart. In a shared living space where you are almost never alone, this was greatly appreciated.<br />\n<br />\nOur schedules were such that we often made dinner together. Keith would make one of the four things within his repertoire — bean and cheese burritos, pasta, a bowl of cereal, or a peanut butter and jelly sandwich — while I would make one of the three things within my repertoire — frozen pad thai from Trader Joe's, soy tacos, or a bowl of cereal — and then we'd sit down to eat while discussing all of life's greatest matters. He would tell me about how much he liked his girlfriend, and I would tell him about the incredible nap I took in the library between classes. Sometimes I'd ask his opinion on the current boy I was dating, and he'd always tell me honestly if he thought they were duds (most of them were).<br />\n<br />\nI wasn't as close to the other boys in the apartment, but we still got along well. Sometimes we'd all go to Triangle's frat parties as a sort of roommate bonding event where we would drink keg beer and solve differential equations. (Just kidding. About the beer.)<br />\n<br />\nIt was a different dynamic than when I'd lived with girls, and each situation had its own pros and cons. In some ways, living with the boys felt like less of a competitive environment, and I never heard any of them calling any of the other guys fat (which, sadly, I witnessed one of my previous girl roommates do), but I still missed having women around and getting their perspective on my thoughts and ideas. I wonder if I didn't live with Alan now if I'd choose to live with boys, girls, or a mix? Or maybe alone?<br />\n<br />\nWho do you live with and do you have a preference?&nbsp;</div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"18","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/2656998591923325560/comments"},"labels":["My (Mildly) Roaring 20s"]}