{"kind":"blogger#post","id":"3808044630363750170","blog":{"id":"2360593805083673688"},"published":"2011-05-16T06:00:00-07:00","updated":"2011-05-16T06:00:09-07:00","url":"http://www.quietlikehorses.com/2011/05/st-johns-burgers-and-poor-house-bistro.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/3808044630363750170","title":"St. John's Burgers and The Poor House Bistro","content":"<a href=\"http://3.bp.blogspot.com/-tsXfl99qVa0/TdCzGRlTXMI/AAAAAAAAGqU/al9DyA2Nlcg/s1600/Untitled-1.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><img style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 600px; height: 1296px;\" src=\"http://3.bp.blogspot.com/-tsXfl99qVa0/TdCzGRlTXMI/AAAAAAAAGqU/al9DyA2Nlcg/s1600/Untitled-1.jpg\" border=\"0\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5607178456456715458\" /></a>This weekend felt indulgent. We slept in, read fun books, and tried two restaurants we've been wanting to eat at for a while. First, there was the <a href=\"http://bit.ly/iDQFxI\">Poor House Bistro</a> in downtown San Jose that's known for making a mean po' boy. I had never had one before, and I guess going into the meal expecting my sandwich world to be rocked did not help matters. Because there was little rocking going on that night. It's not that the BBQ shrimp po' boy I had was <i>that</i> bad, it just wasn't <i>that </i>good either. Alan's gumbo didn't blow me away, and so there we were, Alan and I and our two mediocre entrees. One of us probably would have cried that night, but luckily there were a few stand-outs. The corn bread was sweet and amazing, the cajun fries were golden and thoroughly seasoned, and let's not forget about the doughy fried puffs: the beignets nestled under a generous heaping of powdered sugar. Give me a fried piece of dough, and I can look past a sad sandwich any day (at least until we've paid the check and driven home). <div><br /></div><div>Following my disappointment over the po'ly made po' boy the night before, I was nervous to try <a href=\"http://bit.ly/jTEdOS\">St. John's</a> burgers. I thought it might have been better to steer clear of anything sandwiched between two pieces of bread, but Alan had been to St. John's before and assured me they were good. Skeptical, I warmed up a bit more not when I saw the place was completely packed, but when I saw they offered three kinds of dipping ketchup. <i>This was my kind of place</i>. I foolishly ordered a basic cheeseburger (to \"really get a taste for the burger itself\"), while Alan went straight for the kobe burger with thick slices of bacon and sauteed mushrooms. His burger was definitely the winner. Lesson of the day: burgers always taste better with bacon and mushrooms. The only thing better is a bacon and mushroom burger that's half off! (Wednesday and Saturdays are half off burger nights :)</div><div><div><br /></div><div>  <br /><div style=\"text-align: center;\"><br /></div></div></div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"2","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/3808044630363750170/comments"},"labels":["To Eat"]}