{"kind":"blogger#post","id":"4772451246282906040","blog":{"id":"2360593805083673688"},"published":"2011-12-08T02:30:00-08:00","updated":"2011-12-08T02:30:01-08:00","url":"http://www.quietlikehorses.com/2011/12/my-mildly-roaring-20s-interview.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/4772451246282906040","title":"My (Mildly) Roaring 20s: Interview Questions","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div style=\"text-align: center;\"> <a href=\"http://1.bp.blogspot.com/-_wXwKAZBuz0/TuBuP8rM6II/AAAAAAAAMc8/fYMALxUJqvk/s1600/this+time+tomorrow.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><img border=\"0\" height=\"400\" src=\"http://1.bp.blogspot.com/-_wXwKAZBuz0/TuBuP8rM6II/AAAAAAAAMc8/fYMALxUJqvk/s400/this+time+tomorrow.jpg\" width=\"266\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-dOKEM4FfC_s/TuBt4wWBORI/AAAAAAAAMc0/ypdV4tQgEbc/s1600/76983474849895751_sAm0mqYl_c.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://3.bp.blogspot.com/-dOKEM4FfC_s/TuBt4wWBORI/AAAAAAAAMc0/ypdV4tQgEbc/s400/76983474849895751_sAm0mqYl_c.jpg\" width=\"265\" /></a></div><br />\nOne of my very smart and also very good-looking friends in college once got the weirdest question while at an interview for a top tier medical school. The interviewer asked her, \"So, why does a pretty girl like you want to go to med school?\" It made my jaw drop when she told me, but she brushed it off (which made me feel a little bit like we had traveled back in time to the 1950s).<br />\n<br />\nI'd think about it from time to time, especially whenever I'd be getting ready for an upcoming interview myself. Sometimes I think about my friend and I imagine her sitting in this huge office on a velvet wing-backed chair talking to this faculty member — a good ol' boy with a pipe in one hand. I wonder if she was sweating (I'd be sweating). Sometimes I think about how I'd respond. It wasn't until this week that I saw past the question's chauvinistic exterior and saw it for what it really was: something to throw her off the trail.<br />\n<br />\nThis week we started interviewing candidates at work. I always drink lots of coffee beforehand so I can be sure that I'm focused — picking your new colleague is a big deal. You spend almost all your waking hours sitting inside next to the people you work with, so if you have a say in the matter, make sure you try to pick someone you think you'll like. But that's way easier said than done.<br />\n<br />\nTo me, interviewing candidates sort of feels like going on a blind date where you're both trying to see if you're compatible in the short time you have before the check arrives. The problem is that, just like on the first date, everyone tells you what you want to hear. I find the hardest part is getting them to tell me something different, something that tells me who they<i> really</i> are. We're interviewing a few more people this week, and in the spirit of getting to know these good people who have come all this way to talk to us, I'm considering asking them something different beyond the standard stuff. Now I don't want to scare them away with a bunch of atypical questions, so instead I've narrowed it down to just one:<br />\n<br />\nIf you had to watch a TV marathon of either MSNBC's <i>Lockup </i>or MTV's <i>Teen Mom 2</i>, which one would you watch and why?<br />\n<br />\nThe responses, I think, should be quite telling.<br />\n<br />\n</ul><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div><b>What's the craziest interview question you've ever been asked? </b></div><div><b><br />\n</b></div><div><b>(</b>Top photo<b> </b>via <a href=\"http://bit.ly/t0CIuQ\" target=\"_blank\">This Time Tomorrow</a>, bottom photo via <a href=\"http://bit.ly/uiMQuQ\" target=\"_blank\">Pinterest</a>)</div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"5","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/4772451246282906040/comments"},"labels":["My (Mildly) Roaring 20s"]}