{"kind":"blogger#post","id":"4885885345953570386","blog":{"id":"2360593805083673688"},"published":"2010-12-29T02:00:00-08:00","updated":"2010-12-29T02:00:05-08:00","url":"http://www.quietlikehorses.com/2010/12/resolve.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/4885885345953570386","title":"Resolve","content":"<div style=\"text-align: center;\"><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TRrYa9JsQeI/AAAAAAAAE9I/7mDVo_DtDOU/s1600/paper%2Bbanner.JPG\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 600px; height: 400px;\" src=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TRrYa9JsQeI/AAAAAAAAE9I/7mDVo_DtDOU/s1600/paper%2Bbanner.JPG\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5555991047918338530\" border=\"0\" /></a><span style=\"font-size:85%;\">(a simple paper banner I made for Saturday's party which reminds me of resolution #3)</span><br /><br /></div><div style=\"text-align: left;\"> When I was younger, around this time of year, I would sit and fill an entire page of binder paper (college ruled) with new year's resolutions. They spanned the gamut from the specific and mundane -- e.g. keep backpack tidier -- to the more elusive -- e.g. be happy. Eventually I realized that I could keep about, oh, one resolution going for at least a solid month if I really tried, and then for the past few years I'd given up on them all together. For some reason, this year, I felt compelled to jot a few down.<br /></div><br />1) Sleep better. This will be enormously challenging for me since I am the type of person who needs at least 8 hours of sleep but who finds there are always 20 more things to get done before bed. I find myself staying up late all the time even though I know how much better I'd feel in the mornings if I only went to bed earlier.<br /><br />2) Eat better. Specifically, I'm going to attempt to cut potato chips out of my diet because I noticed that when the smokers at work step outside for a smoke, I join them for a bowl of chips. Which is then accompanied by my chips with lunch and my chips for my mid-afternoon snack. Yes, addiction comes in many forms.<br /><br />3) Simplify. The process of packing and moving has forced me to take a cold hard look at the many knick knacks I've accumulated over the years. More than once this week, I've had to ask myself <span style=\"font-style: italic;\">do I really need this old wad of receipts </span>or<span style=\"font-style: italic;\"> will these ear bud attachments that I've never worn before ever come in handy? </span><span style=\"font-style: italic;\"> </span>So next year, I am going to really try to live simply. And tidily.","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"3","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/4885885345953570386/comments"},"labels":["To See"]}