{"kind":"blogger#post","id":"5213792057131678999","blog":{"id":"2360593805083673688"},"published":"2012-08-07T02:30:00-07:00","updated":"2012-08-07T02:30:01-07:00","url":"http://www.quietlikehorses.com/2012/08/office-talk-do-you-love-your-job.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5213792057131678999","title":"Office Talk: Do you love your job?","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://2.bp.blogspot.com/-sag8YDa4R8Q/UCCydwzVDZI/AAAAAAAAOng/RfnNmpsPUfE/s1600/confetti+desk.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://2.bp.blogspot.com/-sag8YDa4R8Q/UCCydwzVDZI/AAAAAAAAOng/RfnNmpsPUfE/s1600/confetti+desk.jpeg\" /></a></div>\nIn the past, whenever I found myself talking to someone about their job, I'd just have to ask, \"Do you love it?\" Most of the time people shrugged or admitted they didn't, but sometimes, on what felt like very rare occasions, people said yes. And whenever that happened, something inside of me would light up and feel full of hope. Because for a long time, I didn't feel anything close to love for what I did.&nbsp;Work was just work and it felt like the hours spent sitting at my desk stretched on forever.&nbsp;On really bad days, I secretly wondered if loving your job was even possible. While a lot of people worry that they'll never find <i>the one, </i>I worried that I'd never find <i>the job.&nbsp;</i><br />\n<br />\n<a name='more'></a><br />\nBut then, a few weeks ago, I was at a wedding talking to a friend about my job when she turned the question around on me. \"Do you love it?\" she asked. I had been thinking about it for a while but hadn't really admitted it to anyone yet, and so because I'm always afraid of jinxing a good thing, I told her that I really, really liked it. She smiled and said that was close enough.<br />\n<br />\nWhen I thought about it later, I realized that a lot of what I love about my current job is the fact that it feels so much like being back in college. Everything we work on is like working on one big group project (which a lot of people in school hated, but was something I was pretty good at). My team eats lunch all together like we're eating in the dining commons. Scoring bonuses tied to bi-yearly goals is like getting a straight-A report card after a hard semester. Walking across the street to one of the three other buildings for a meeting or to use the espresso machine feels like walking across campus. And coming in as late as 11 (as the designers on my team do) is like opting out of an 8 a.m. class to sign up for an 8 p.m. one just because it suits you better. <br />\n<br />\nIt was funny to think about it in those terms and made me realize I'm an even bigger nerd than I thought :) Are there things about your job that you love? Did it surprise you when you realized how much you liked your job? I still get a little giddy when I hear about people who love what they do.<br />\n<br />\np.s. a super interesting post on the <a href=\"http://bit.ly/MpJAHL\" target=\"_blank\">science of loving what you do</a><br />\n<br />\n(photo by Bonnie Tsang via <a href=\"http://bit.ly/RgudGI\" target=\"_blank\">The Glitter Guide</a>)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"3","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5213792057131678999/comments"},"labels":["office talk","To See"]}