{"kind":"blogger#post","id":"5677730489350532564","blog":{"id":"2360593805083673688"},"published":"2011-10-13T02:30:00-07:00","updated":"2011-10-13T21:34:16-07:00","url":"http://www.quietlikehorses.com/2011/10/life-with-cancer-after-cancer.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5677730489350532564","title":"Life (with Cancer) After Cancer","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-82uEu7Lw0Ag/TpaJBWlCIVI/AAAAAAAAJec/p7lqQ_EwzhE/s1600/xkcd.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"1400\" src=\"http://1.bp.blogspot.com/-82uEu7Lw0Ag/TpaJBWlCIVI/AAAAAAAAJec/p7lqQ_EwzhE/s1600/xkcd.pn\" width=\"600\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br />\n</div><div class=\"separator\" style=\"clear: both; text-align: left;\">Last week, I was standing over a co-worker's computer talking to him about the redemption rates of digital coupons when I saw the news break that Steve Jobs had died. My hand shot up to my mouth, and we looked at each other. He said, \"Well, that's not surprising.\"</div><br />\nWhen I picked Alan up from work, I asked if he had heard the news, and he said, \"Yes. And I don't really want to talk about a guy who died from cancer.\" We switched topics and talked about something else the rest of the way home.<br />\n<br />\nIn this week's <i>My (Mildly) Roaring 20s</i> post, I'd like to talk about what life with Alan has been like after his own battle with cancer and the one lingering thing I thought would go away but never did.<br />\n<br />\n<a name='more'></a><br />\n<div style=\"text-align: center;\"><a href=\"http://2.bp.blogspot.com/-XU4K2wSbotU/TpZ-2anVyfI/AAAAAAAAJd4/HfW8m6_tSPY/s1600/alan.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://2.bp.blogspot.com/-XU4K2wSbotU/TpZ-2anVyfI/AAAAAAAAJd4/HfW8m6_tSPY/s640/alan.jpg\" width=\"600\" /></a></div><div style=\"text-align: -webkit-auto;\"><br />\nWhen Alan was first diagnosed with colorectal cancer in 2009, we were given heaps of tri-fold brochures and thick packets of information to read about what we could expect in the coming months. Alan felt overwhelmed staring at the stacks of paper, and for a while they sat on our coffee table untouched. I began reading through them and putting things in folders labeled: \"cancer resources,\" \"financial stuff,\" \"what to expect when you're expecting cancer.\" We barely went back and referenced any of it, but I remember reading about how we could expect his hair to fall out from the chemo. I remember how amused I was when, contrary to the popular image of the bald headed cancer patient, he maintained his thick head of hair throughout treatment. They talked about how his skin would dry and how his nails would crack and turn yellow. (It turned out his nails were fine, but they were right about his skin, which grew rough, like sandpaper). And there were 24-hour hotline numbers printed on the back of all the brochures for  those desperate moments, I assumed, when he'd need someone, anyone, to talk to. I pointed these out to Alan in case he ever felt the need, but he never called those numbers. I guess those numbers aren't for everyone.</div><div style=\"text-align: center;\"><div style=\"text-align: -webkit-auto;\"><br />\n</div></div><div style=\"text-align: center;\"><a href=\"http://4.bp.blogspot.com/-HxGcRzKAyAk/TpZ-7tHVn2I/AAAAAAAAJeA/JDrY2kdlhRY/s1600/alan+closed.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://4.bp.blogspot.com/-HxGcRzKAyAk/TpZ-7tHVn2I/AAAAAAAAJeA/JDrY2kdlhRY/s1600/alan+closed.jpg\" width=\"600\" /></a></div><div style=\"text-align: center;\">{In exactly 1/2 of the pictures I take of Alan, his eyes are closed. Here is proof.}</div><div><br />\n</div>For all the preparation we received, there was one thing that no one ever mentioned: that after it was all over (the chemo, the radiation, the deep-seated fear, the blood tests, the scans), it would never <i>really</i> be all over. Of course, some of it is long gone, but the fear, the thing that I assumed would disappear when he got better, never went away.<br />\n<br />\nIt’s gotten better over time, but for a while, every week there’d be a new crisis: this weird pain in his left shoulder, this dull ache in his leg. To him, they all signaled the return of his cancer. It seemed that the better things got in life, the more he had to lose and the more paranoid he became of his body’s impending betrayal. When he'd start to worry, it would be intense, keeping him up at night and weighing him down.<br />\n<br />\nWhen friends and family ask me how Alan’s doing these days, I say he’s doing great — because he is — but I never tell them about the fear. For the longest time, I couldn’t really explain it. I didn’t know how to put it into words that wouldn’t sound silly. Then my friend Irene sent me this <a href=\"http://bit.ly/qiL8Kv\">xkcd comic</a> (above) with a note “thought you should see this” and it was like ah ha! This explains it exactly.<br />\n<br />\nWhen the fear sets in, all I can do is reassure him that that weird pain — a pain that would simply be a nuisance to anyone else — is probably nothing and that he’s going to be okay. And, also, to not talk about Steve Jobs.<br />\n<div><br />\n<br />\n</div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"12","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5677730489350532564/comments"},"labels":["My (Mildly) Roaring 20s"]}