{"kind":"blogger#post","id":"5779247899895466002","blog":{"id":"2360593805083673688"},"published":"2010-09-29T02:00:00-07:00","updated":"2010-09-29T02:00:05-07:00","url":"http://www.quietlikehorses.com/2010/09/chocolate-taste-test.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5779247899895466002","title":"Chocolate Taste Test","content":"<a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKK-2tgwCdI/AAAAAAAAEec/t8j4T3ECKJM/s1600/chocolate.JPG\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 400px;\" src=\"http://3.bp.blogspot.com/_mkw1MyhyGTY/TKK-2tgwCdI/AAAAAAAAEec/t8j4T3ECKJM/s1600/chocolate.JPG\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185940248824274\" border=\"0\" /></a>Some of my most vivid memories of Halloween while growing up revolve around the various treats I ate. I remember I'd get home from a long night of trick-or-treating and dump out the contents of my plastic pumpkin pail in the middle of the living room floor. I would divide the candy into two piles. The good pile consisted of things like gummy bears and Skittles. The bad pile was made up of chocolate bars and Tootsie rolls. This was before I learned to appreciate chocolate. Back then, I called it \"last resort candy,\" the candy I'd eat only once my good stash ran out and when I'd get desperate for something sweet.<br /><br />I've definitely learned to appreciate chocolate now that I'm older, and on the rare occasion, I even crave it. It was on one of these days that I passed by Powell's Sweet Shoppe and ended up coming home with a bag full of novelty chocolates. In true trick-or-treating fashion, I present you with my piles of the good and the bad.<br /><br /><a href=\"http://2.bp.blogspot.com/_mkw1MyhyGTY/TKK-SBTFaeI/AAAAAAAAEds/faR8LGq2vno/s1600/Recently+Updated4.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 375px;\" src=\"http://2.bp.blogspot.com/_mkw1MyhyGTY/TKK-SBTFaeI/AAAAAAAAEds/faR8LGq2vno/s1600/Recently+Updated4.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185309905054178\" border=\"0\" /></a>Chocolate bar #1: Milky Way by Mars Chocolat France. This one proudly promised only 98 calories per bar, but truth be told, its dreamy, galactic wrapper is what really drew me in. The description on the side of the wrapper read \"milk chocolate with a light whipped white centre.\" In addition to being incredibly vague, it also sounds a bit unappetizing. What <span style=\"font-style: italic;\">is </span>a whipped white centre anyway? Why not just call it nougat? Well, it turns out they didn't call it nougat for a reason. The centre (love how it's spelled that way) was not very nougat-like at all and left a strange peanut-like aftertaste. Though not entirely unpleasant, I just didn't know what to make of it and couldn't help but compare it to its better tasting trio of American cousins, the Three Musketeers.<br /><br /><a href=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-S8PZ4FI/AAAAAAAAEd8/ly-cN2E9dXw/s1600/curlywurly.JPG\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 397px;\" src=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-S8PZ4FI/AAAAAAAAEd8/ly-cN2E9dXw/s1600/curlywurly.JPG\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185325727309906\" border=\"0\" /></a>Chocolate bar #2: Curlywurly by Cadbury Portugal. This milk chocolate bar with a caramel centre boasts a fantastic name. I could only imagine what a Curlywurly would taste like, but, with a moniker like that, I was sure it would be delightful. Upon unwrapping it, I was pleased with the candy's fun shape which did in fact curl and wurl. However, I'm sad to report that the team that created this bar spent a disproportionate amount of time naming and designing this candy than they did perfecting the taste. The caramel centre did not wow me, and overall it was just too sweet.<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-SWZ7b4I/AAAAAAAAEd0/xLDGBOESdts/s1600/Recently+Updated5.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 600px;\" src=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-SWZ7b4I/AAAAAAAAEd0/xLDGBOESdts/s1600/Recently+Updated5.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185315570904962\" border=\"0\" /></a>Chocolate bar #3: Flake by Cadbury Ireland. When it comes to satisfying my chocolate cravings, I often think of words like \"smooth,\" \"velvety,\" and \"rich.\" The Flake bar challenged my view of what chocolate should be with words that I normally associate with saw dust. It touts itself as the \"crumbliest, flakiest milk chocolate.\" Now, although I was not a huge fan, I will hand it to Cadbury Ireland for their honest marketing -- the Flake bar was definitely the crumbliest milk chocolate I've ever had. I would say more, but I learned early on that if I don't have anything nice to say, I shouldn't say anything at all. So I will definitely not tell you that it sort of tasted like chalk.<br /><br /><a href=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-TDSAgBI/AAAAAAAAEeE/M7MkTyYz3KY/s1600/dream.JPG\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 400px;\" src=\"http://1.bp.blogspot.com/_mkw1MyhyGTY/TKK-TDSAgBI/AAAAAAAAEeE/M7MkTyYz3KY/s1600/dream.JPG\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185327617277970\" border=\"0\" /></a>Chocolate bar #4: Dream by Cadbury France. Sometimes when I am out with people I'm trying to impress, I'll order a glass of red wine instead of white, even though I think I would rather have a glass of iced tea. It just seems like the more sophisticated choice for those with refined palates. I have a feeling eating white chocolate instead of dark might be the equivalent of ordering an iced tea while everyone else is drinking pinot grigio, but whatever, I like white chocolate. It's yummy, and it reminds me of eating white chocolate Easter bunnies. Since Easter only comes around once a year, this candy bar makes for a dreamy year-round substitute.<br /><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TKK-RtjtHYI/AAAAAAAAEdk/a1GwJDEPq5k/s1600/Recently+Updated6.jpg\"><img style=\"margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 600px; height: 375px;\" src=\"http://4.bp.blogspot.com/_mkw1MyhyGTY/TKK-RtjtHYI/AAAAAAAAEdk/a1GwJDEPq5k/s1600/Recently+Updated6.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5522185304606055810\" border=\"0\" /></a>Chocolate bar #5: Kinder Bueno by Ferrero. From the makers of Ferrero Rocher and Nutella comes another wondrous treat. This milk chocolate covered wafer includes a smooth milky and hazelnut filling. I appreciated the adjectives of smooth, milky and hazelnut that described the filling (yeah, that's right, I'm talking to you Milky Way bar with obscure whipped white centre!) The delicate crunch of the wafer offsets the smoothness of the filling and was reminiscent of the bite of Ferrero Rocher chocolates. It was not too sweet and had just the faintest hazelnut taste -- the clear winner of my chocolate taste test!","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"10","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5779247899895466002/comments"},"labels":["To Eat"]}