{"kind":"blogger#post","id":"5965237606701806450","blog":{"id":"2360593805083673688"},"published":"2012-09-12T06:00:00-07:00","updated":"2012-09-12T09:17:52-07:00","url":"http://www.quietlikehorses.com/2012/09/todays-horoscopes.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5965237606701806450","title":"Today&#39;s Horoscopes","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://2.bp.blogspot.com/-NJDoh1KlrZ0/UFAUUHrUnRI/AAAAAAAAPZY/ZCrqBhN5_PM/s1600/stare.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"483\" src=\"http://2.bp.blogspot.com/-NJDoh1KlrZ0/UFAUUHrUnRI/AAAAAAAAPZY/ZCrqBhN5_PM/s1600/stare.jpeg\" width=\"600\" /></a></div>\nDo you read your horoscope? I never did until my friend Lauren got me hooked on Susan Miller's horoscopes. She's amazingly right a lot of the time—sometimes it can be kinda freaky just how right she is. I even got the app for my phone so now I can read it daily (you can read your <a href=\"http://bit.ly/Q1hhlF\" target=\"_blank\">monthly horoscope</a> for free on her website). Reading horoscopes can feel like cracking open a fortune cookie in anticipation of reading what's inside (the small thrills :) Just for fun, want to read your horoscope for the day? <br />\n<br />\n<a name='more'></a><br />\n<b>Aries:</b> Your love life will sizzle and your sweetheart may give you a surprise that literally sweeps you off your feet! At the same time however, you might end up in a fiery debate over shared resources. Try not to allow a clash over money or debt get in the way of what will otherwise be a spectacular day for romance. You might not always agree about how the bills get paid, but your feelings for each other will certainly be in sync.<a href=\"http://www.blogger.com/blogger.g?blogID=2360593805083673688\" name=\"more\"></a><br />\n<br />\n<b>Taurus: </b>You might feel a burst of creative energy and will want to spend at least part of the day in solitude at home cultivating it. Unfortunately, you might experience some tension with your partner, who might not be willing to offer you any privacy. He or she might also be in an argumentative mood and if so, will manage to ignite your temper as well. Try to keep things in perspective and if you can, focus on your innovative project.<br />\n<br />\n<b>Gemini:</b> Today will be a brilliant time for social networking and communications endeavors with friends. If you have any speeches or presentations planned, aim for early in the day when the energy will be in your favor. Later on, you might lose this edge in communications and will somehow become embroiled in conflict with a co-worker or colleague. Do your best to avoid a hasty exchange of words you might later regret.<br />\n<br />\n<b>Cancer: </b>You'll have an extraordinary edge if you showcase one of your innovative talents to a VIP early today. Not only will he or she be thoroughly impressed, you might also open up exciting potential to earn money by utilizing this gift. You may also possibly feel some tension with a child or sweetheart later in the day. You might feel as if this person is more of a financial strain than usual since a big ticket expense on his or her end might affect your wallet.<br />\n<br />\n<b>Leo: </b>You might feel more wanderlust than usual today, but luckily you'll also find an avenue to express this need for adventure. You might spend time dreaming up your next exotic vacation, or surf the Web for your local university for an adult education class on a topic you've always wanted to learn more about. Although you'll feel excited about the possibilities, a relative might express a lack of support for your latest venture. Don't let it bring you down.<br />\n<br />\n<b>Virgo (my sign!):</b> The urge to spend more time alone will be strong. If possible, schedule a few hours where you can rest and rejuvenate without distraction. Today will also be a great time to do research on an investment opportunity since you'll likely come up with an exceptionally helpful tidbit. In addition, avoid any conversation with a sibling or cousin you feel may lead to an argument. You might lack patience to speak to this person and if so, put off the conversation until tomorrow.<br />\n<br />\n<b>Libra: </b>Make the most of any opportunity to develop social contacts this week. A friend may introduce you to someone who might become a new client, business partner, or other important alliance for you. At the same time, today might not be the best day to move forward in any type of financial collaboration with a pal or a group you belong to. There might be a disagreement about how to allocate funds.<br />\n<br />\n<b>Scorpio:</b> If you're working on a team project with colleagues, it's likely that you'll come up with an innovative approach to further the success of your joint endeavor. In fact, whatever you develop now is certain to impress the boss. The key to making sure this turns into a win will be to refrain from over promoting yourself. Emphasize that this is a collaboration -- you'll impress a VIP much more than if you were to take most of the credit.<br />\n<br />\n<b>Sagittarius:</b> You'll have a chance for a big day of fun and adventure with a child or sweetheart. You'll enjoy a sport or other recreational activity together and will delight in friendly competition. If you're involved in any international business, you might want to keep discussions under wraps today or at least try to fly below the radar to ensure you don't reveal any major strategy prematurely. Do your best to handle any impatience you may feel connected to the situation.<br />\n<br />\n<b>Capricorn: </b>You might have an incredible stroke of luck if you're hoping to purchase a home or refinance the mortgage on your existing property. Shop around for the best rates since you're likely to score big on the most competitive one! Later in the day you might feel tension with a friend, especially if you know this person is making a rash decision about his or her finances. You'll try to help but your pay might not appreciate your input. Tread lightly.<br />\n<br />\n<b>Aquarius: </b>Today will be a good time to sign a contract or make a sudden new alliance in business or your personal life. You might also have an unexpected but positive conversation with your partner about an offbeat topic you both find fascinating. When it comes to authority figures connected to your career, or even a business partner, you might feel that pressure is mounting. A minor quarrel can turn into a major headache if you're not careful.<br />\n<br />\n<b>Pisces:</b> Today might be a fabulous day to pick up a second job or extra freelance assignment, if you're looking. You'll find an innovative way to add to your income, even if it's a temporary stint. In addition, you might experience a disagreement with a co-worker that will prove distracting. You may feel as if you're in sync when it comes to personal beliefs, and this clash might make it difficult for you to work together. Do your best.<br />\n<br />\n<b>So, what's your sign? Any Aries out there? That's one juicy horoscope ;)</b><br />\n<b><br />\n</b><br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\">\n<a href=\"http://1.bp.blogspot.com/-f28W3sGG23I/UFAiyKFg6eI/AAAAAAAAPa4/jXCs_udxez8/s1600/fortune+cookie.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-f28W3sGG23I/UFAiyKFg6eI/AAAAAAAAPa4/jXCs_udxez8/s1600/fortune+cookie.jpeg\" /></a></div>\n<b><br />\n</b>(top image via <a href=\"http://bit.ly/OeNkgm\" target=\"_blank\">A Cup of Jo</a>, bottom image via <a href=\"http://bit.ly/RR3Jwo\" target=\"_blank\">Pinterest</a>; all horoscopes by <a href=\"http://bit.ly/Q1hhlF\" target=\"_blank\">Susan Miller</a>)","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"2","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/5965237606701806450/comments"},"labels":["To See"]}