{"kind":"blogger#post","id":"7599186077169714348","blog":{"id":"2360593805083673688"},"published":"2011-10-12T02:30:00-07:00","updated":"2011-10-12T02:30:01-07:00","url":"http://www.quietlikehorses.com/2011/10/wise-words-for-creatives.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/7599186077169714348","title":"Wise Words for Creatives","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-XSgeDaNiv-8/TpUlJ_zjLiI/AAAAAAAAJdg/uL0RQ7rVP8A/s1600/chairs.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-XSgeDaNiv-8/TpUlJ_zjLiI/AAAAAAAAJdg/uL0RQ7rVP8A/s1600/chairs.jpg\" /></a></div><br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-c4UQWERAkDY/TpUlL3g0JCI/AAAAAAAAJdo/lqEBqFt1GDo/s1600/macarons.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-c4UQWERAkDY/TpUlL3g0JCI/AAAAAAAAJdo/lqEBqFt1GDo/s1600/macarons.jpg\" /></a></div><br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-tCmo2gZXGSs/TpUlMH_u06I/AAAAAAAAJdw/RW9TLzuVuWE/s1600/objects.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-tCmo2gZXGSs/TpUlMH_u06I/AAAAAAAAJdw/RW9TLzuVuWE/s1600/objects.jpg\" /></a></div><br />\nAs a blogger and a writer, I'm always looking to improve. I want to take better pictures, write more compelling stories... the list is endless. Some days, I'm more optimistic about my progress than others. On the bad days, I feel like I'm not doing enough — not enough, not better, not faster. It can be a catty, catty game that drives me crazy. But then I read or hear something that really inspires me. One person's work that I really admire for knowing how to captivate audiences so well is Ira Glass's. My friend <a href=\"http://bit.ly/pdOtu9\">Stacy</a> got me totally hooked on his radio show, This American Life. He's an amazing storyteller. Since I'm a fairly new listener, I'd assumed he'd always been a genius storyteller, so it surprised me when I read this <a href=\"http://bit.ly/oV4boq\">(slightly paraphrased) quote</a> by him on how he thought his work sucked for years when he first started and how this is normal for creative people who create great work. In&nbsp;this <a href=\"http://bit.ly/nrgLwi\">videocast series</a>&nbsp;where the quote is from,&nbsp;he talks about how he thinks he still sucked after he'd been broadcasting for <i>eight years!</i>&nbsp;If he can struggle for nearly a decade and be as great as he is, there's hope for the rest of us.<br />\n<br />\n<br />\n\"Nobody tells this to people who are beginners, I wish someone told me. All of us who do creative work, we get into it because we have good taste. But there is this gap. For the first couple years you make stuff, it’s just not that good. It’s trying to be good, it has potential, but it’s not. But your taste, the thing that got you into the game, is still killer. And your taste is why your work disappoints you. A lot of people never get past this phase, they quit. Most people I know who do interesting, creative work went through years of this. We know our work doesn’t have this special thing that we want it to have. We all go through this. And if you are just starting out or you are still in this phase, you gotta know its normal and the most important thing you can do is do a lot of work. Put yourself on a deadline so that every week you will finish one story. It is only by going through a volume of work that you will close that gap, and your work will be as good as your ambitions. And I took longer to figure out how to do this than anyone I’ve ever met. It’s gonna take awhile. It’s normal to take awhile. You’ve just gotta fight your way through that.\"<br />\n<br />\n— Ira Glass<br />\n<div><br />\n</div>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"5","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/7599186077169714348/comments"},"labels":["To See"]}