{"kind":"blogger#post","id":"8945112643500414602","blog":{"id":"2360593805083673688"},"published":"2011-11-21T02:30:00-08:00","updated":"2011-11-21T02:30:02-08:00","url":"http://www.quietlikehorses.com/2011/11/have-you-ever-been-kissed-by-surprise.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8945112643500414602","title":"Have you ever been kissed by surprise?","content":"<div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-MoL5MvB49G8/TsnRHxTylqI/AAAAAAAAMUg/NA85ss_k6Es/s1600/kiss.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"400\" src=\"http://2.bp.blogspot.com/-MoL5MvB49G8/TsnRHxTylqI/AAAAAAAAMUg/NA85ss_k6Es/s1600/kiss.jpg\" width=\"600\" /></a></div><br />\nHave you ever been kissed by surprise? I never have, but I think they're one of the funniest kinds of kisses — they turn a (usually) intimate moment between two people into something completely goofy. My friend <a href=\"http://bit.ly/pdOtu9\" target=\"_blank\">Stacy</a> was once kissed by surprise, and there's even the greatest photo booth pictures of all time to go along with it! Every time I see it, it makes me laugh. Here's her story...<br />\n<br />\nMy husband Robbie has this crazy tradition where he kisses the groom each time a friend gets married. It started a couple of years ago when he was a groomsman in his good friend’s wedding. After the wedding party walked out of the wedding, they all gathered in a private room to celebrate while guests exited the church, and Robbie planted a big, fat, wet one on his friend! The groom was surprised, the rest of the wedding party was surprised, and I would say that even Robbie was a little surprised.<br />\n<br />\nSince then, he has decided to make it a tradition to kiss his (groom) friends on their wedding days. He’ll even go so far as to inform people it’s a compliment when they're kissed, because of course this means he considers you a good friend. When our good friends, Alison and Elijah, got married last year, the tradition hadn't changed. Before the wedding, someone spilled the beans and gave Elijah warning about what to expect on his big day. This made Robbie’s mission a bit more challenging.<br />\n<br />\nElijah spent most of the day dodging kisses from Robbie. He swiftly avoided him while he was talking to his grandparents, he blocked him from sneaking up on him from around a corner, and he escaped an “almost trapped” situation in the kitchen. At this point, Robbie probably sounds a little bit like a creep, but I do want to provide the disclaimer that this specific situation had turned into a battle of wills. Elijah was determined to avoid the kiss and Robbie was determined to plant the kiss.<br />\n<br />\nMeanwhile, us ladies were having a blast. We were dancing, mingling, and taking part in the photo booth they had set up. Since Alison and Elijah would be moving in with us after the wedding, we thought it would be a great idea to take a roommate picture in the photo booth. &nbsp;We gathered up and decided on what theme each of the four frames would include: official, silly, crazy, and improv.<br />\n<br />\nWe all looked great for the first frame. I made sure to do my usual angry face and threatening choke for the second. Sarah and I leaned in to give Alison cheek kisses on the third, and that’s when it happened. I had my eyes closed and lips puckered facing Alison. All of a sudden I felt lips pressed against mine and they were not Robbie’s. Alison had planted a big, fat, wet one on ME! I was in complete shock and couldn’t stop laughing at the same time.&nbsp;After “the kiss,” Alison explained that since Robbie wanted to steal a kiss from her lover so badly, she decided to steal a kiss from his.<br />\n<br />\n<br />\n<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://1.bp.blogspot.com/-2TPVxLbWruE/TsmROV4pWKI/AAAAAAAAMUY/5PTUIkJsFSI/s1600/surprise+kiss.jpg\" imageanchor=\"1\" style=\"font-family: Times; font-size: medium; margin-left: 1em; margin-right: 1em; text-align: center; white-space: normal;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-2TPVxLbWruE/TsmROV4pWKI/AAAAAAAAMUY/5PTUIkJsFSI/s1600/surprise+kiss.jpg\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><b>Aren't the photos priceless? Robbie's face in the third frame cracks me up. And I love how surprised Stacy looks in the last frame and how Ali's totally flipping her hair back like \"Gotcha!\"</b></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br />\n</div><b style=\"text-align: left;\">Thanks for sharing,&nbsp;<a href=\"http://bit.ly/pdOtu9\" target=\"_blank\">Stacy</a>!&nbsp;</b><br />\n<b style=\"text-align: left;\"><br />\n</b><br />\n<span style=\"text-align: left;\">(Top photo via <a href=\"http://bit.ly/td5P61\" target=\"_blank\">pinterest</a>)</span>","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"2","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/8945112643500414602/comments"},"labels":["To See"]}