{"kind":"blogger#post","id":"9197055446959315532","blog":{"id":"2360593805083673688"},"published":"2011-06-01T21:16:00-07:00","updated":"2011-06-01T21:36:50-07:00","url":"http://www.quietlikehorses.com/2011/06/boston.html","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/9197055446959315532","title":"Boston","content":"<a href=\"http://2.bp.blogspot.com/-dsdnCijCEVw/TecPnAdEMGI/AAAAAAAAGug/s8l-xFtME_g/s1600/park.JPG\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><img style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 600px; height: 400px;\" src=\"http://2.bp.blogspot.com/-dsdnCijCEVw/TecPnAdEMGI/AAAAAAAAGug/s8l-xFtME_g/s1600/park.JPG\" border=\"0\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5613472623351836770\" /></a>I landed in Boston last night and am here through Friday. I wanted to write a longer post with more pictures, but my internet connection is crummy. Instead, I'll tell you about my day, it being a particularly nice Wednesday. This morning I woke up early, walked to <a href=\"http://bit.ly/kZdbAk\">Flour</a> for one of their famous sticky buns (amazing) and marveled at 1) how warm it was (it's warmer in Boston right now than it is in California!) 2) how all the buildings are made of brick and there are gorgeous green parks everywhere 3) how stylish everyone is. After I got back from my sticky bun breakfast, it started thundering and pouring rain out of nowhere. I navigated my way through the \"T\" stations to our rent-a-office in Cambridge. At one point, I got a teensy bit lost and asked someone for directions and 2 other people standing nearby turned to help me. Everyone is so nice here! While on the subway, I pictured Matt Damon in <i>Good Will Hunting</i> (you know that scene where he's riding the T?) and the pony-tailed guy sitting next to me told me he worked in the music department at Harvard which I thought was pretty fitting for the day, and this made me happy. Tonight it rained hard, but more impressive was the thunder and lightning. Frightening and beautiful all at once. It's been lots of fun being in a new city. Hope you all are having a grand week!","author":{"id":"06629562195146939698","displayName":"Sobrina Tung","url":"http://www.blogger.com/profile/06629562195146939698","image":{"url":"http://3.bp.blogspot.com/_mkw1MyhyGTY/TI8X4CO5nWI/AAAAAAAAERk/4p5D74gYdFE/S45/me.JPG"}},"replies":{"totalItems":"3","selfLink":"https://www.googleapis.com/blogger/v3/blogs/2360593805083673688/posts/9197055446959315532/comments"},"labels":["To See"]}